package work_with_file;

public class CopyEx_BufferedReader_BufferWriter {
    // BufferedReader_BufferWriter ❤️

    /**  Буферизация это процесс загрузки части файла, происходящая во время потоковой передачи, например музыки
     или видео до их воспроизведения. Эта форма буферизации позволяет смотреть или слушать медиа файлы почти
     мгновенно, загружая только часть файла, затем воспроизводя его, пока оставшаяся часть продолжает загружаться.

     Использование буферизации в стримах позволяет достичь большей эффективности при чтении файла или записи в него

     📍 BufferWriter writer = new BufferWriter (new FileWriter("file1.txt"));
     📍 BufferReader reader = new BufferReader (new FileReader("file1.txt"));

     Т/е /BufferedReader и BufferWriter/ - это обвертки (wraps). ❗️Они оборачивают FileWriter и FileReader
     и добавляют функциональность буферизации. ❗️


      */
}
